app/views/applicants/show.html.erb

SELECT "colleges".* FROM "colleges" WHERE "colleges"."applicant_id" = ?  [["applicant_id", 7]]
---
<h2>Colleges</h2>
<% @applicant.colleges.each do |college| %>