app/controllers/applicants_controller.rb

  def index
    $my_instances = {}
    # $my_instances[1] = {one: 2}
    @applicants = Applicant.all
---
SELECT "applicants".* FROM "applicants"

  def create
    # puts params.id
    @applicant = Applicant.new(applicant_params)


    @applicant.save
---
INSERT INTO "applicants" ("name", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?)  [["name", "Bart"], ["created_at", "2020-01-28 03:30:28.595142"], ["updated_at", "2020-01-28 03:30:28.595142"], ["slug", "bart"]]

  def show
    # @applicant = Applicant.find(params[:id])
    @applicant = Applicant.friendly.find(params[:id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def allColleges
      #   @applicant.colleges.each do |college|
      #   end
      @applicant.colleges.order("score DESC")
---
SELECT "colleges".* FROM "colleges" WHERE "colleges"."applicant_id" = ? ORDER BY score DESC  [["applicant_id", 2]]