app/controllers/colleges_controller.rb

SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "colleges" ("college", "score", "applicant_id", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?)  [["college", "Subway"], ["score", 10], ["applicant_id", 1], ["created_at", "2020-01-28 01:45:55.946011"], ["updated_at", "2020-01-28 01:45:55.946011"], ["slug", "subway"]]
---
  def create
    puts params
    # @applicant = Applicant.find(params[:slug])
    @applicant = Applicant.friendly.find(params[:applicant_id])
    @college = @applicant.colleges.build(college_params)
    if @college.save

SELECT "applicants".* FROM "applicants" WHERE "applicants"."college_id" IN (?, ?)  [["college_id", "1"], ["college_id", "2"]]
SELECT "colleges".* FROM "colleges"
---
  def index
    @colleges =  College.all.includes(:applicants)

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @colleges = College.friendly.find(params[:id])