app/controllers/colleges_controller.rb

SELECT "colleges".* FROM "colleges"
---
  def index
    # @colleges = College.all.joins(:applicant_id)

    # puts @colleges
    # render json: @colleges

    @colleges = College.all